In [2]:
# imports
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
# grab data from web
import webbrowser
website='http://en.wikipedia.org/wiki/NFL_win-loss_records'
webbrowser.open(website)

True

In [8]:
# copy data from clipboard (first few rows of table copied from wikipedia) to create a DataFrame
nfl_frame = pd.read_clipboard()
nfl_frame

,Rank,Team,Won,Lost,Tied,Pct.,First,NFL,Season,Total,Games,Division
0,1,Chicago,Bears,741,555,42,0.570,1920.000,"1,338",NFC,North,NaN
1,2,Dallas,Cowboys,480,364,6,0.568,1960.000,850,NFC,East,NaN
2,3,Green,Bay,Packers,720,547,37.000,0.566,1921,"1,304",NFC,North
3,4,Miami,Dolphins,429,335,4,0.561,1966.000,768,AFC,East,NaN
4,5,New,England,Patriots,462,381,9.000,0.548,1960,852,AFC,East

In [10]:
# view column names
nfl_frame.columns

Index([u'Rank', u'Team', u'Won', u'Lost', u'Tied', u'Pct.', u'First', u'NFL',
       u'Season', u'Total', u'Games', u'Division'],
      dtype='object')

In [15]:
nfl_frame['First NFL
          Season']

SyntaxError: EOL while scanning string literal (<ipython-input-15-d9ba7d50ae5a>, line 1)

In [22]:
# data from https://datatables.net/
test_frame = pd.read_clipboard()
test_frame

,Name,Position,Office,Age,Start date,Salary
0,Name,Position,Office,Age,Start date,Salary
1,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
2,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
3,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
4,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
5,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [24]:
test_frame['Start date']

0    Start date
1    2008/11/28
2    2009/10/09
3    2009/01/12
4    2012/10/13
5    2011/06/07
Name: Start date, dtype: object

In [26]:
# grab multiple columns
DataFrame(test_frame, columns=['Name', 'Position', 'Salary', 'Branch'])

             Name                       Position      Salary  Branch
0            Name                       Position      Salary     NaN
1      Airi Satou                     Accountant    $162,700     NaN
2  Angelica Ramos  Chief Executive Officer (CEO)  $1,200,000     NaN
3      Ashton Cox        Junior Technical Author     $86,000     NaN
4   Bradley Greer              Software Engineer    $132,000     NaN
5  Brenden Wagner              Software Engineer    $206,850     NaN

In [27]:
# Retrieve rows from a data frame
test_frame

,Name,Position,Office,Age,Start date,Salary
0,Name,Position,Office,Age,Start date,Salary
1,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
2,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"
3,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000"
4,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000"
5,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850"

In [29]:
# retrieves first 5 rows by default or no. of rows specified in argument of head() function
test_frame.head(3)

,Name,Position,Office,Age,Start date,Salary
0,Name,Position,Office,Age,Start date,Salary
1,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700"
2,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000"

In [32]:
# retrieve rows on a particular index
test_frame.ix[1]

Name          Airi Satou
Position      Accountant
Office             Tokyo
Age                   33
Start date    2008/11/28
Salary          $162,700
Name: 1, dtype: object

In [35]:
# Assign entire column with a stadium name
test_frame['Branch'] = "London"
test_frame

,Name,Position,Office,Age,Start date,Salary,Branch
0,Name,Position,Office,Age,Start date,Salary,London
1,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700",London
2,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000",London
3,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000",London
4,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000",London
5,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850",London

In [37]:
test_frame['Branch'] = np.array(["London", "Machester", "Essex", "Ealing", "Kent", "Leicster"])
test_frame

,Name,Position,Office,Age,Start date,Salary,Branch
0,Name,Position,Office,Age,Start date,Salary,London
1,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700",Machester
2,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000",Essex
3,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000",Ealing
4,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000",Kent
5,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850",Leicster

In [39]:
nationality = Series(["British", "Canadian"], index=[5,0])
test_frame["nationality"] = nationality
test_frame

,Name,Position,Office,Age,Start date,Salary,Branch,nationality
0,Name,Position,Office,Age,Start date,Salary,London,Canadian
1,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700",Machester,NaN
2,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000",Essex,NaN
3,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000",Ealing,NaN
4,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000",Kent,NaN
5,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850",Leicster,British

In [40]:
# to delete column from dataframe
del test_frame["Branch"]
test_frame

,Name,Position,Office,Age,Start date,Salary,nationality
0,Name,Position,Office,Age,Start date,Salary,Canadian
1,Airi Satou,Accountant,Tokyo,33,2008/11/28,"$162,700",NaN
2,Angelica Ramos,Chief Executive Officer (CEO),London,47,2009/10/09,"$1,200,000",NaN
3,Ashton Cox,Junior Technical Author,San Francisco,66,2009/01/12,"$86,000",NaN
4,Bradley Greer,Software Engineer,London,41,2012/10/13,"$132,000",NaN
5,Brenden Wagner,Software Engineer,San Francisco,28,2011/06/07,"$206,850",British

In [41]:
# can also construct data frames by using dictionaries
data = {'city' : ['SF', 'LA','NYC' ],
       'population' : [837000,388000, 8400000]}
city_frame = DataFrame(data)
city_frame

  city  population
0   SF      837000
1   LA      388000
2  NYC     8400000